Python/scripts/openfoam_runs_pointwise/AOA_10/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

#include "../system/includeDict";

internalField   uniform $omegai;

boundaryField
{
    farfield
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }
    side
    {
        type            empty;
    }
    airfoil
    {
        type            omegaWallFunction;
        value           $internalField;
    }
}


// ************************************************************************* //
