Python/scripts/openfoam_runs_pointwise/AOA_10/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2006                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];


internalField   uniform 0;

boundaryField
{
    airfoil
    {
        type            calculated;
        value           nonuniform List<scalar> 
570
(
0.2732501927841563
0.2764002532310968
0.2773707419969573
0.2785616004470212
0.2801874689826796
0.2824665276702207
0.2857490322991248
0.2906348747784404
...
)
;
    }
    farfield
    {
        type            calculated;
        value           uniform 0;
    }
    side
    {
        type            empty;
    }
}


// ************************************************************************* //
