Python/scripts/openfoam_runs_pointwise/AOA_10/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "../system/includeDict";

transportModel  Newtonian;

rho             rho [1 -3 0 0 0 0 0] 	1;      //density 
nu              nu [0 2 -1 0 0 0 0] 	$nui; 	//kinematic viscosity

// ************************************************************************* //
