Python/scripts/openfoam_runs_pointwise/AOA_10/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 | 
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           | 
|  \\    /   O peration     | Version:  v2006                                 | 
|   \\  /    A nd           | Website:  www.openfoam.com                      | 
|    \\/     M anipulation  |                                                 | 
\*---------------------------------------------------------------------------*/ 

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "includeDict";

application 		simpleFoam;

startFrom 			latestTime;

stopAt 				endTime;

endTime 			5001;

deltaT 				1;

writeControl 		timeStep;

writeInterval 		100;

purgeWrite 			1;

writeFormat 		ascii;

writePrecision 		16;

writeCompression 	no;

timeFormat 			general;

timePrecision 		12;

runTimeModifiable 	yes;


functions
{
    #include "forceCoeffs";
    //#include "yPlus";
    #includeFunc "wallShearStress";
    #include "residualsMonitorDict";
    //#include "surfaces";
}
